{
    "章タイトル": "第7章：分詞 (現在分詞・過去分詞)",
    "章の説明": "分詞（現在分詞-ingと過去分詞-ed）は、動詞から作られた形容詞のようなもので、名詞を修飾して文をより具体的にします。また、分詞構文を使うことで、2つの文を簡潔に接続し、洗練された表現をすることが可能になります。学会発表のスライドで多用される表現です。",
    "セクション": [
        {
            "セクションタイトル": "現在分詞の形容詞的用法 (～している)",
            "セクションの説明": "現在分詞(-ing)が名詞を修飾し、「～している」という能動的・進行的な意味を加えます。名詞の前や後ろに置かれます。",
            "例文": [
                {
                    "日本語": "私たちの研究は、ARにおける既存のトラッキング技術の限界に取り組んでいます。",
                    "英語": "Our research addresses the limitations of existing tracking technologies in augmented reality.",
                    "ポイント": "「既存の」という意味で、名詞technologiesを前から修飾する現在分詞です。"
                },
                {
                    "日本語": "最終的な点群を示している画像は、次のスライドにあります。",
                    "英語": "The image showing the final point cloud is on the next slide.",
                    "ポイント": "imageという名詞を、「何を示しているか」を説明するshowing以下の句が後ろから修飾しています。"
                },
                {
                    "日本語": "これは、ライトフィールド技術の将来性を示す、非常に有望な結果です。",
                    "英語": "This is a very promising result, indicating the potential of light field technology.",
                    "ポイント": "名詞resultを前から修飾するpromisingと、文全体を補足説明する分詞構文indicatingです。"
                },
                {
                    "日本語": "移動するプラットフォームからのリアルタイム再構成は、依然として困難な課題です。",
                    "英語": "Real-time reconstruction from a moving platform remains a challenging problem.",
                    "ポイント": "「困難な」という意味で、名詞problemを前から修飾するchallengingです。"
                },
                {
                    "日本語": "私たちの研究室に所属している学生が、この実験を行いました。",
                    "英語": "A student belonging to our laboratory conducted this series of experiments.",
                    "ポイント": "studentを、belonging to our laboratoryという句が後ろから修飾しています。"
                },
                {
                    "日本語": "その結果には、いくつかの興味深いパターンが含まれています。",
                    "英語": "The results contain several interesting patterns that we need to analyze.",
                    "ポイント": "名詞patternsを前から修飾するinterestingです。感情を表す分詞の用法。"
                },
                {
                    "日本語": "RGB-DセンサーとIMUから来るデータを統合するモジュールがあります。",
                    "英語": "There is a module integrating the data coming from the RGB-D sensor and an IMU.",
                    "ポイント": "moduleをintegrating...が、dataをcoming from...が、それぞれ後ろから修飾しています。"
                },
                {
                    "日本語": "残りの問題については、今後の研究で議論する予定です。",
                    "英語": "We will discuss the remaining issues in our future work.",
                    "ポイント": "名詞issuesを前から修飾するremaining (残っている)です。"
                },
                {
                    "日本語": "この分野で働いている多くの研究者が、同じような課題に直面しています。",
                    "英語": "Many researchers working in this field are facing similar challenges.",
                    "ポイント": "researchersを、working in this fieldという句が後ろから修飾しています。"
                },
                {
                    "日本語": "私たちの研究室は、最先端のマルチビューキャプチャシステムを所有しています。",
                    "英語": "Our lab possesses a leading-edge multi-view capture system.",
                    "ポイント": "「最先端の」という意味で、名詞systemを前から修飾するleading-edgeです。"
                }
            ]
        },
        {
            "セクションタイトル": "過去分詞の形容詞的用法 (～された)",
            "セクションの説明": "過去分詞(-ed)が名詞を修飾し、「～された」という受動的・完了的な意味を加えます。技術的な説明では極めて頻繁に使われます。",
            "例文": [
                {
                    "日本語": "私たちの手法によって生成された点群は、はるかに高密度です。",
                    "英語": "The point cloud generated by our method is much denser than the others.",
                    "ポイント": "point cloudを「何によって生成されたか」を説明するgenerated by...という句が後ろから修飾しています。"
                },
                {
                    "日本語": "この実験では、完全にキャリブレーションされたマルチビューカメラシステムを使いました。",
                    "英語": "We used a fully calibrated multi-view camera system for this experiment.",
                    "ポイント": "「キャリブレーションされた」という完了・受動の意味で、名詞systemを前から修飾しています。"
                },
                {
                    "日本語": "図1に示されたデータは、私たちの主張を裏付けています。",
                    "英語": "The data shown in Figure 1 supports our main claim.",
                    "ポイント": "dataを「どこに示されているか」を説明するshown in...という句が後ろから修飾しています。"
                },
                {
                    "日本語": "提案手法の限界について、いくつか質問があります。",
                    "英語": "I have a few questions regarding the proposed method's limitations.",
                    "ポイント": "「提案された」という意味で、名詞methodを前から修飾しています。"
                },
                {
                    "日本語": "拡張現実とは、コンピュータが生成した情報を現実世界に重ね合わせる技術です。",
                    "英語": "Augmented reality is a technology that overlays computer-generated information onto the real world.",
                    "ポイント": "「コンピュータによって生成された」という意味で、名詞informationを前から修飾しています。"
                },
                {
                    "日本語": "リアルタイム処理を実現するために、最適化されたアルゴリズムを開発しました。",
                    "英語": "We developed an optimized algorithm to achieve real-time processing.",
                    "ポイント": "「最適化された」という意味で、名詞algorithmを前から修飾しています。"
                },
                {
                    "日本語": "これは、ライトフィールドイメージングの分野では、よく知られた問題です。",
                    "英語": "This is a well-known problem in the field of light field imaging.",
                    "ポイント": "「よく知られた」という意味で、名詞problemを前から修飾しています。"
                },
                {
                    "日本語": "私たちは、既知のカメラポーズを持つ合成データセットを使用しました。",
                    "英語": "We used a synthetic dataset with known camera poses for the evaluation.",
                    "ポイント": "「知られている」という意味で、名詞posesを前から修飾しています。"
                },
                {
                    "日本語": "この研究で議論されたすべてのトピックは、非常に興味深いものでした。",
                    "英語": "All the topics discussed in this study were extremely interesting.",
                    "ポイント": "topicsを「この研究で議論された」と説明するdiscussed in...という句が後ろから修飾しています。"
                },
                {
                    "日本語": "そのRGB-Dセンサーによってキャプチャされた深度情報は、かなりノイズが多いです。",
                    "英語": "The depth information captured by that RGB-D sensor is quite noisy.",
                    "ポイント": "informationを「何によってキャプチャされたか」を説明するcaptured by...という句が後ろから修飾しています。"
                }
            ]
        },
        {
            "セクションタイトル": "分詞構文",
            "セクションの説明": "接続詞や関係代名詞の代わりに分詞を用いることで、文を簡潔にし、よりスムーズな論理の流れを作り出します。理由、時間、付帯状況などを表します。",
            "例文": [
                {
                    "日本語": "この手法を用いることで、リアルタイム性能を達成しました。",
                    "英語": "Using this method, we successfully achieved real-time performance.",
                    "ポイント": "「～を用いて」という手段・理由を表す分詞構文です。As we used this method,...とほぼ同じ意味です。"
                },
                {
                    "日本語": "カメラのポーズが分かっているので、点群を画像に投影できます。",
                    "英語": "Knowing the exact camera pose, we can project the point cloud onto the image.",
                    "ポイント": "「～なので」という理由を表す分詞構文です。Because we know...と同じ意味です。"
                },
                {
                    "日本語": "先行研究と比較すると、私たちの手法はより高い精度を示しています。",
                    "英語": "Compared to previous work, our method shows a much higher accuracy.",
                    "ポイント": "「～と比較すると」という意味の、慣用的な過去分詞の分詞構文です。"
                },
                {
                    "日本語": "このノイズの多いデータを考えると、その結果は非常に素晴らしいです。",
                    "英語": "Given this noisy input data, the result is actually quite impressive.",
                    "ポイント": "「～を考慮すると」という意味の、慣用的な過去分詞の分詞構文です。"
                },
                {
                    "日本語": "キャリブレーションを終えた後、私たちは主実験を開始しました。",
                    "英語": "Having finished the calibration, we started to conduct the main experiment.",
                    "ポイント": "主節の動作より「前に完了したこと」を明確に示す、Having + 過去分詞の形です。"
                },
                {
                    "日本語": "一般的に言うと、マルチビューステレオはテクスチャを必要とします。",
                    "英語": "Generally speaking, multi-view stereo requires rich textures to work well.",
                    "ポイント": "「一般的に言うと」という意味の、独立分詞構文と呼ばれる慣用表現です。"
                },
                {
                    "日本語": "彼はプレゼンテーションを終え、聴衆からの質問を促しました。",
                    "英語": "He finished his presentation, inviting questions from the audience.",
                    "ポイント": "「そして～した」という連続した動作を表す分詞構文です。"
                },
                {
                    "日本語": "パラメータを調整して、私たちは実験を再度実行しました。",
                    "英語": "Adjusting the parameters slightly, we ran the experiment one more time.",
                    "ポイント": "「～しながら」という付帯状況を表す分詞構文です。"
                },
                {
                    "日本語": "厳密に言えば、これはリアルタイムシステムではありません。",
                    "英語": "Strictly speaking, this is not a real-time system due to the latency.",
                    "ポイント": "「厳密に言えば」という意味の、独立分詞構文です。"
                },
                {
                    "日本語": "他のすべての条件を同じにして、私たちは二つのアルゴリズムを比較しました。",
                    "英語": "Keeping all other conditions the same, we compared the two algorithms.",
                    "ポイント": "「～の状態に保ちながら」という付帯状況を表す分詞構文です。"
                }
            ]
        },
        {
            "セクションタイトル": "感情を表す分詞",
            "セクションの説明": "感情の原因となるモノ・コトには-ing形（interestingなど）、感情を感じるヒトには-ed形（interestedなど）を使います。使い分けを間違えやすいので注意が必要です。",
            "例文": [
                {
                    "日本語": "それは非常に驚くべき結果で、私たちは再確認が必要でした。",
                    "英語": "That was a very surprising result, and we needed to double-check it.",
                    "ポイント": "結果が「驚きの原因」なので、-ing形のsurprisingを使います。"
                },
                {
                    "日本語": "あなたの手法がリアルタイムで動作するのを見て、とても驚きました。",
                    "英語": "I was very surprised to see that your method works in real-time.",
                    "ポイント": "私が「驚きを感じた」ので、-ed形のsurprisedを使います。"
                },
                {
                    "日本語": "私はあなたのライトフィールドの研究に非常に興味があります。",
                    "英語": "I am very interested in your recent research on light field rendering.",
                    "ポイント": "私が「興味を感じている」ので、-ed形のinterestedを使います。"
                },
                {
                    "日本語": "あなたの発表は、私にとって非常に興味深いものでした。",
                    "英語": "I found your presentation to be very interesting and insightful.",
                    "ポイント": "発表が「興味深さの原因」なので、-ing形のinterestingを使います。"
                },
                {
                    "日本語": "RGB-Dデータのノイズには、時々いらいらさせられます。",
                    "英語": "The noise in the RGB-D data can be quite frustrating at times.",
                    "ポイント": "ノイズが「いらだちの原因」なので、-ing形のfrustratingです。"
                },
                {
                    "日本語": "この分野の将来性には、本当にわくわくしています。",
                    "英語": "I am really excited about the future potential of this research field.",
                    "ポイント": "私が「わくわくしている」ので、-ed形のexcitedです。"
                },
                {
                    "日本語": "マルチビューシステムのキャリブレーションは、退屈な作業になり得ます。",
                    "英語": "Calibrating a multi-view system can be a very boring and tedious task.",
                    "ポイント": "作業が「退屈さの原因」なので、-ing形のboringです。"
                },
                {
                    "日本語": "最終結果には完全に満足しています。",
                    "英語": "We are fully satisfied with the final results of our experiments.",
                    "ポイント": "私たちが「満足させられた」ので、-ed形のsatisfiedです。"
                },
                {
                    "日本語": "ライトフィールド技術が3Dイメージングの未来だと確信しています。",
                    "英語": "I am convinced that light field technology is the future of 3D imaging.",
                    "ポイント": "私が「確信させられている」ので、-ed形のconvincedです。"
                },
                {
                    "日本語": "彼の質問の意図は、少し分かりにくいものでした。",
                    "英語": "The intention behind his question was a little bit confusing to me.",
                    "ポイント": "質問の意図が「混乱の原因」なので、-ing形のconfusingです。"
                }
            ]
        }
    ]
}